{
    "title": "Custom Dialogue Tool",

    "content": "Unity Tool | Dialogue System | Custom Editor",

    "imageUrl": "Images/ProjectData/SSDialogueTool.png",

    "pageLink":"DevProjects/proj-dialogue-tool.html",

    "fromTitleLink":"DevProjects/proj-dialogue-tool.html",

    "videoUrl": "https://www.youtube.com/embed/9yGib-2zKTc?si=XYwg6_pjzOzdRps_",

    "gameEngine": "Unity",

    "status": "Development Complete",

    "description":"Ready to defend your village against a horde of rampaging goblins!? You are the village's last hope of an organized defense. Build towers and lay traps to successfully defend. The village has a variety to provide with mages and archers! But the horde is equally well equipped to fight! Lets see how wins! The hunger of the horde or the determination and grit to survive of humans!",

    "roles": 
    [
        "Designed and developed the concept of the game.",
        "Scripted all of game functionality including Managers, Gameplay features: Hero character, AI enemies, Towers and Placement mechanics.",
        "Design and development on abilities for the hero.",
        "Modular code to expand, asset integration (models,animations).",
        "Integration with a level editor tool made for easy level building."
    ],

    "tech":
    [
        "Unity",
        "C#",
        "Unity Asset Store",
        "Github",
        "JIRA"
    ],

    "details":
    "This ongoing project entails the development of a 3D Tower Defense game utilizing Unity and C#. The game revolves around defending your base/town hall against waves of incoming enemies. In addition to traditional tower placement, players have the ability to control a playable character (hero) equipped with various abilities to defeat enemies. Currently, the game features only one type of enemy (melee). The Enemy AI is designed to locate the town hall and move towards it with the intention of destruction. They can switch targets, attacking the player hero character when incoming and reverting to targeting the town hall once the hero is defeated. This system is implemented using Unity Navmesh Agent, Pathfinding, and State Machines. The user interface (UI) comprises simple buttons for tower placement, offering a choice between two types: Single Target and Area Effect Towers. Additionally, the UI enables the selection of player abilities during gameplay. While the game is being developed primarily for the PC platform, it can be seamlessly adapted for mobile platforms. The provided link directs to the latest video in the development log; for a comprehensive view of the entire process, please subscribe to the YouTube channel."

   
}